import vk from '../assets/vk.webp';
import yt from '../assets/youtube.webp';
import inst from '../assets/inst.webp';
import ST_MINI from '../assets/station-eywa.jpg';

export const socials = [{
    'id': 1,
    'name': "VK",
    'img': vk
},
{
    'id': 2,
    'name': "YouTube",
    'img': yt
},
{
    'id': 3,
    'name': "Instagram",
    'img': inst
}
]


export const products = [
    {
        "id": 1,
        "name": "Станция Эйва Mini",
        "disc": "Станция Эйва Mini имеет кубический вид - это идеальная форма, четкая геометрия и строгость линий. Выполнена в лаконичном стиле и подходящей цветовой палитре, что позволяет вписать станцию в любой интерьер. Станция контролирует влажность воздуха вокруг растения, при помощи системы генерации тумана, датчиков влажности и температуры воздуха. А также поддерживает определенное количество влаги в почве посредством работы датчика влажности почвы и системы полива. За счет съемной конструкции этого датчика и съемного внутреннего горшка, с растением удобно проводить различные манипуляции в случае необходимости.",
        "characteristic": [
            {
                "name": "Функционал",
                "items": ["- Автополив", "- Туман", "- Веб-интерфейс", "- Интерактивный логотип", "- Датчики температуры",]
            },
            {
                "name": "Технические характеристики:",
                "items": ["- Габариты устройства: 285x180x180 мм", "- Масса станции: 1.3 кг", "", "- Диаметр цветочного горшка: 13 см",
                 "- Датчики: Влажности воздуха, почвы, уровня воды", "- Объем бака для воды: 1,6 л"]
            },
            {
                "name": "Условия эксплуатации:",
                "items": ["- Температура: 10-30 °C", "- Влажность: 70%"]
            }   
        ],
        "images": [ST_MINI],
        "videos": ["https://www.youtube.com/embed/YNstjSvrsPw", "https://www.youtube.com/embed/rUNovkiVOdE"]
    },
    {
        "id": 2,
        "name": "Станция Эйва",
        "disc": "Станция Эйва имеет кубический вид - это идеальная форма, четкая геометрия и строгость линий. Выполнена в лаконичном стиле и подходящей цветовой палитре, что позволяет вписать станцию в любой интерьер. Станция контролирует влажность воздуха вокруг растения, при помощи системы генерации тумана, датчиков влажности и температуры воздуха. А также поддерживает определенное количество влаги в почве посредством работы датчика влажности почвы и системы полива. За счет съемной конструкции этого датчика и съемного внутреннего горшка, с растением удобно проводить различные манипуляции в случае необходимости.",
        "characteristic": [
            {
                "name": "Функционал",
                "items": ["- Автополив", "- Туман", "- Веб-интерфейс", "- Интерактивный логотип", "- Датчики температуры",]
            },
            {
                "name": "Технические характеристики:",
                "items": ["- Габариты устройства: 285x180x180 мм", "- Масса станции: 1.3 кг", "", "- Диаметр цветочного горшка: 13 см",
                 "- Датчики: Влажности воздуха, почвы, уровня воды", "- Объем бака для воды: 1,6 л"]
            },
            {
                "name": "Условия эксплуатации:",
                "items": ["- Температура: 10-30 °C", "- Влажность: 70%"]
            }   
        ],
        "videos": ["https://www.youtube.com/embed/YNstjSvrsPw", "https://www.youtube.com/embed/rUNovkiVOdE"]
    },
    {
        "id": 3,
        "name": "Станция Эйва Сити",
        "disc": "Станция Эйва Сити имеет кубический вид - это идеальная форма, четкая геометрия и строгость линий. Выполнена в лаконичном стиле и подходящей цветовой палитре, что позволяет вписать станцию в любой интерьер. Станция контролирует влажность воздуха вокруг растения, при помощи системы генерации тумана, датчиков влажности и температуры воздуха. А также поддерживает определенное количество влаги в почве посредством работы датчика влажности почвы и системы полива. За счет съемной конструкции этого датчика и съемного внутреннего горшка, с растением удобно проводить различные манипуляции в случае необходимости.",
        "characteristic": [
            {
                "name": "Функционал",
                "items": ["- Автополив", "- Туман", "- Веб-интерфейс", "- Интерактивный логотип", "- Датчики температуры",]
            },
            {
                "name": "Технические характеристики:",
                "items": ["- Габариты устройства: 285x180x180 мм", "- Масса станции: 1.3 кг", "", "- Диаметр цветочного горшка: 13 см",
                 "- Датчики: Влажности воздуха, почвы, уровня воды", "- Объем бака для воды: 1,6 л"]
            },
            {
                "name": "Условия эксплуатации:",
                "items": ["- Температура: 10-30 °C", "- Влажность: 70%"]
            }   
        ],
        "videos": ["https://www.youtube.com/embed/YNstjSvrsPw", "https://www.youtube.com/embed/rUNovkiVOdE"]
    }
]
